Tekla Open API Reference for Tekla Structures 2025
ModelHandler.IsModelSaved Method
Tells whether current model has been saved.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsModelSaved()
Public Function IsModelSaved As Boolean
Return Value
Type: Boolean
True if there are no unsaved changes in the model.
See Also
Reference
ModelHandler Class
Tekla.Structures.Model Namespace